feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxPort_bf.h
/** \brief  Offset for Ifx_P_ESR_Bits.EN3 */
#define IFX_P_ESR_EN3_OFF (3u)

/** \brief  Length for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN4 */
#define IFX_P_ESR_EN4_OFF (4u)

/** \brief  Length for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN5 */
#define IFX_P_ESR_EN5_OFF (5u)

/** \brief  Length for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN6 */
#define IFX_P_ESR_EN6_OFF (6u)

/** \brief  Length for Ifx_P_ESR_Bits.EN7 */
#define IFX_P_ESR_EN7_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN7 */
#define IFX_P_ESR_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN7 */
#define IFX_P_ESR_EN7_OFF (7u)

/** \brief  Length for Ifx_P_ESR_Bits.EN8 */
#define IFX_P_ESR_EN8_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN8 */
#define IFX_P_ESR_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN8 */
#define IFX_P_ESR_EN8_OFF (8u)

/** \brief  Length for Ifx_P_ESR_Bits.EN9 */
#define IFX_P_ESR_EN9_LEN (1u)

/** \brief  Mask for Ifx_P_ESR_Bits.EN9 */
#define IFX_P_ESR_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_P_ESR_Bits.EN9 */
#define IFX_P_ESR_EN9_OFF (9u)

/** \brief  Length for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_P_ID_Bits.MODNUMBER */
#define IFX_P_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_P_ID_Bits.MODREV */
#define IFX_P_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_P_ID_Bits.MODTYPE */
#define IFX_P_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P0 */
#define IFX_P_IN_P0_OFF (0u)

/** \brief  Length for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P10 */
#define IFX_P_IN_P10_OFF (10u)

/** \brief  Length for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P11 */
#define IFX_P_IN_P11_OFF (11u)

/** \brief  Length for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P12 */
#define IFX_P_IN_P12_OFF (12u)

/** \brief  Length for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P13 */
#define IFX_P_IN_P13_OFF (13u)

/** \brief  Length for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P14 */
#define IFX_P_IN_P14_OFF (14u)

/** \brief  Length for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P15 */
#define IFX_P_IN_P15_OFF (15u)

/** \brief  Length for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P1 */
#define IFX_P_IN_P1_OFF (1u)

/** \brief  Length for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P2 */
#define IFX_P_IN_P2_OFF (2u)

/** \brief  Length for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P3 */
#define IFX_P_IN_P3_OFF (3u)

/** \brief  Length for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P4 */
#define IFX_P_IN_P4_OFF (4u)

/** \brief  Length for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P5 */
#define IFX_P_IN_P5_OFF (5u)

/** \brief  Length for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P6 */
#define IFX_P_IN_P6_OFF (6u)

/** \brief  Length for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P7 */
#define IFX_P_IN_P7_OFF (7u)

/** \brief  Length for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P8 */
#define IFX_P_IN_P8_OFF (8u)

/** \brief  Length for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_LEN (1u)

/** \brief  Mask for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_MSK (0x1u)

/** \brief  Offset for Ifx_P_IN_Bits.P9 */
#define IFX_P_IN_P9_OFF (9u)

/** \brief  Length for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR0_Bits.PC0 */
#define IFX_P_IOCR0_PC0_OFF (3u)

/** \brief  Length for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_MSK (0x1fu)

