feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxPort_bf.h
/** \brief  Offset for Ifx_P_IOCR0_Bits.PC1 */
#define IFX_P_IOCR0_PC1_OFF (11u)

/** \brief  Length for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR0_Bits.PC2 */
#define IFX_P_IOCR0_PC2_OFF (19u)

/** \brief  Length for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR0_Bits.PC3 */
#define IFX_P_IOCR0_PC3_OFF (27u)

/** \brief  Length for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR12_Bits.PC12 */
#define IFX_P_IOCR12_PC12_OFF (3u)

/** \brief  Length for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR12_Bits.PC13 */
#define IFX_P_IOCR12_PC13_OFF (11u)

/** \brief  Length for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR12_Bits.PC14 */
#define IFX_P_IOCR12_PC14_OFF (19u)

/** \brief  Length for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR12_Bits.PC15 */
#define IFX_P_IOCR12_PC15_OFF (27u)

/** \brief  Length for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR4_Bits.PC4 */
#define IFX_P_IOCR4_PC4_OFF (3u)

/** \brief  Length for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR4_Bits.PC5 */
#define IFX_P_IOCR4_PC5_OFF (11u)

/** \brief  Length for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR4_Bits.PC6 */
#define IFX_P_IOCR4_PC6_OFF (19u)

/** \brief  Length for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR4_Bits.PC7 */
#define IFX_P_IOCR4_PC7_OFF (27u)

/** \brief  Length for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR8_Bits.PC10 */
#define IFX_P_IOCR8_PC10_OFF (19u)

/** \brief  Length for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR8_Bits.PC11 */
#define IFX_P_IOCR8_PC11_OFF (27u)

/** \brief  Length for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR8_Bits.PC8 */
#define IFX_P_IOCR8_PC8_OFF (3u)

/** \brief  Length for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_LEN (5u)

/** \brief  Mask for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_MSK (0x1fu)

/** \brief  Offset for Ifx_P_IOCR8_Bits.PC9 */
#define IFX_P_IOCR8_PC9_OFF (11u)

/** \brief  Length for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR0_Bits.PS1 */
#define IFX_P_LPCR0_PS1_OFF (1u)

/** \brief  Length for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_LEN (5u)

/** \brief  Mask for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_MSK (0x1fu)

/** \brief  Offset for Ifx_P_LPCR1_P21_Bits.LRXTERM */
#define IFX_P_LPCR1_P21_LRXTERM_OFF (3u)

/** \brief  Length for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR1_P21_Bits.RDIS_CTRL */
#define IFX_P_LPCR1_P21_RDIS_CTRL_OFF (0u)

/** \brief  Length for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR1_P21_Bits.RX_DIS */
#define IFX_P_LPCR1_P21_RX_DIS_OFF (1u)

/** \brief  Length for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR1_P21_Bits.TERM */
#define IFX_P_LPCR1_P21_TERM_OFF (2u)

/** \brief  Length for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR1_Bits.PS1 */
#define IFX_P_LPCR1_PS1_OFF (1u)

/** \brief  Length for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR2_Bits.LVDSR */
#define IFX_P_LPCR2_LVDSR_OFF (8u)

/** \brief  Length for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR2_Bits.LVDSRL */
#define IFX_P_LPCR2_LVDSRL_OFF (9u)

/** \brief  Length for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR2_Bits.TDIS_CTRL */
#define IFX_P_LPCR2_TDIS_CTRL_OFF (12u)

/** \brief  Length for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_LEN (1u)

/** \brief  Mask for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_P_LPCR2_Bits.TX_DIS */
#define IFX_P_LPCR2_TX_DIS_OFF (13u)

