feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxPort_bf.h
/** \brief  Length for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS10 */
#define IFX_P_OMR_PS10_OFF (10u)

/** \brief  Length for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS11 */
#define IFX_P_OMR_PS11_OFF (11u)

/** \brief  Length for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS12 */
#define IFX_P_OMR_PS12_OFF (12u)

/** \brief  Length for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS13 */
#define IFX_P_OMR_PS13_OFF (13u)

/** \brief  Length for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS14 */
#define IFX_P_OMR_PS14_OFF (14u)

/** \brief  Length for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS15 */
#define IFX_P_OMR_PS15_OFF (15u)

/** \brief  Length for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS1 */
#define IFX_P_OMR_PS1_OFF (1u)

/** \brief  Length for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS2 */
#define IFX_P_OMR_PS2_OFF (2u)

/** \brief  Length for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS3 */
#define IFX_P_OMR_PS3_OFF (3u)

/** \brief  Length for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS4 */
#define IFX_P_OMR_PS4_OFF (4u)

/** \brief  Length for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS5 */
#define IFX_P_OMR_PS5_OFF (5u)

/** \brief  Length for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS6 */
#define IFX_P_OMR_PS6_OFF (6u)

/** \brief  Length for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS7 */
#define IFX_P_OMR_PS7_OFF (7u)

/** \brief  Length for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS8 */
#define IFX_P_OMR_PS8_OFF (8u)

/** \brief  Length for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_LEN (1u)

/** \brief  Mask for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMR_Bits.PS9 */
#define IFX_P_OMR_PS9_OFF (9u)

/** \brief  Length for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR0_Bits.PS0 */
#define IFX_P_OMSR0_PS0_OFF (0u)

/** \brief  Length for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR0_Bits.PS1 */
#define IFX_P_OMSR0_PS1_OFF (1u)

/** \brief  Length for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR0_Bits.PS2 */
#define IFX_P_OMSR0_PS2_OFF (2u)

/** \brief  Length for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR0_Bits.PS3 */
#define IFX_P_OMSR0_PS3_OFF (3u)

/** \brief  Length for Ifx_P_OMSR12_Bits.PS12 */
#define IFX_P_OMSR12_PS12_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR12_Bits.PS12 */
#define IFX_P_OMSR12_PS12_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR12_Bits.PS12 */
#define IFX_P_OMSR12_PS12_OFF (12u)

/** \brief  Length for Ifx_P_OMSR12_Bits.PS13 */
#define IFX_P_OMSR12_PS13_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR12_Bits.PS13 */
#define IFX_P_OMSR12_PS13_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR12_Bits.PS13 */
#define IFX_P_OMSR12_PS13_OFF (13u)

/** \brief  Length for Ifx_P_OMSR12_Bits.PS14 */
#define IFX_P_OMSR12_PS14_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR12_Bits.PS14 */
#define IFX_P_OMSR12_PS14_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR12_Bits.PS14 */
#define IFX_P_OMSR12_PS14_OFF (14u)

/** \brief  Length for Ifx_P_OMSR12_Bits.PS15 */
#define IFX_P_OMSR12_PS15_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR12_Bits.PS15 */
#define IFX_P_OMSR12_PS15_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR12_Bits.PS15 */
#define IFX_P_OMSR12_PS15_OFF (15u)

/** \brief  Length for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR4_Bits.PS4 */
#define IFX_P_OMSR4_PS4_OFF (4u)

/** \brief  Length for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR4_Bits.PS5 */
#define IFX_P_OMSR4_PS5_OFF (5u)

/** \brief  Length for Ifx_P_OMSR4_Bits.PS6 */
#define IFX_P_OMSR4_PS6_LEN (1u)

